**** Initialisierung
Für alle nachfolgenden Berechnungen habe ich immer dieses Skript
benutzt, um grundlegende Dinge, wie Funktionen, die an vielen Stellen
benötigt werden, die Daten usw. bereitgestellt werden.  Ferner werden,
wo möglich, Berechnungen mit dieser Initialisierung parallelisiert.

#+NAME: statistic
#+BEGIN_SRC R :exports code :results output :noweb yes
require(MASS)
library(foreach)
library(doMC)
# number of cores to use
registerDoMC(4)

calculationtime = proc.time()
komus = read.table("_data/komus/data-komus-bin.csv",header=TRUE) # Perhaps breaks, it was in another format.
test = data.frame(read.table("_data/komus/data-komus-revised.csv",header=TRUE, sep=','))
pcitems = array(which(sapply(test, max) > 1))
pcitems.temp = pcitems
test[pcitems] = lapply(test[pcitems],factor)

# functions
FUN.infoMC = function(x)
{
    return(rowSums(-x*log(x+0.0000000001, 2)))
}

FUN.infoMC.IND = function(x)
{
    return(sum(-x*log(x+0.0000000001, 2)))
}

FUN.info = function(x)
{
    return(-x*log(x+0.0000000001, 2)-(1-x)*log(1-x+0.0000000001, 2))
}

FUN.Odds = function(x)
{
    if (length(pcitems.temp) > 0)
    {
        x[-pcitems.temp] = lapply(x[-pcitems.temp], predict, type="response")
        x[pcitems.temp] = lapply(x[pcitems.temp], predict, type="probs")
    } else
    {
        x = lapply(x, predict, type="response")
    }
    return(x)
}

FUN.Odds.IND = function(x,y)
{
    x[-pcitems.temp] = lapply(x[-pcitems.temp], predict, data = test[y,], type="response")
    x[pcitems.temp] = lapply(x[pcitems.temp], predict, data = test[y,], type="probs")
    return(x)
}

FUN.info.temp = function(x)
{
    if (length(pcitems.temp) > 0)
    {
        x[pcitems.temp] = lapply(x[pcitems.temp], FUN.infoMC)
        x[-pcitems.temp] =lapply(x[-pcitems.temp], FUN.info)
    } else   
    {
        x =lapply(x, FUN.info)
    }
    x = simplify2array(x)
    return(x)
}

FUN.info.temp.IND = function(x)
{
    if (length(pcitems.temp) > 0)
    {
        x[pcitems.temp] = lapply(x[pcitems.temp], FUN.infoMC.IND)
        x[-pcitems.temp] =lapply(x[-pcitems.temp], FUN.info)
    } else
    {
        x =lapply(x, FUN.info)
    }
    x = simplify2array(x)
    return(x)
}

FUN.EntroMC = function(funpcitems.temp, fundata, funmod)
{
    if (length(funpcitems.temp) == 1)
    {
        odds = lapply(funmod, predict, fundata, type="response")
        info.temp = odds
        info.temp = lapply(odds, FUN.info)
        info.temp = simplify2array(info.temp)
    } else
    {
        funpcitems.temp = funpcitems.temp[2:length(funpcitems.temp)]
        odds = funmod
        odds[-funpcitems.temp] = lapply(funmod[-funpcitems.temp], predict, fundata, type="response")
        odds[funpcitems.temp] = lapply(funmod[funpcitems.temp], predict, fundata, type="probs")
        info.temp = odds
        info.temp[funpcitems.temp] = lapply(odds[funpcitems.temp], FUN.infoMC.IND)
        info.temp[-funpcitems.temp] = lapply(odds[-funpcitems.temp], FUN.info)
        info.temp = simplify2array(info.temp)
    }
    return(info.temp)
}

odds = NULL
fit = NULL
modell = NULL
summe = data.frame()

# number of items and persons to consider in this calculation
items = length(test)
persons = length(test[,1])

info = NULL
info.rest = data.frame(matrix(ncol = 1, nrow = items+1))
info.rest.SD = data.frame(matrix(ncol = 1, nrow = items+1))
names(info.rest) = 'kill'
names(info.rest.SD) = 'kill'

entropie = data.frame(matrix(ncol = 1, nrow = items+1))
entropie.SD = data.frame(matrix(ncol = 1, nrow = items+1))
names(entropie) = 'kill'
names(entropie.SD) = 'kill'
#+END_SRC

#+RESULTS: statistic
: Loading required package: MASS
: Error in library(foreach) : there is no package called 'foreach'
: Error in library(doMC) : there is no package called 'doMC'
: Error: could not find function "registerDoMC"

***** Zahlensystemkonverter
#+BEGIN_SRC python :exports both

# Zahlensystemkonverter
Konvertierungszahl = 1000
Zahlenraum = 20
Zahlensystem = [[0] for i in range(Zahlenraum - 1)]
Resultat = [[''] * 2 for i in range(Zahlenraum - 1)]

for i in range(2, Zahlenraum + 1):
    Stelle = 0
    Zahlensystem[i-2][0] = Konvertierungszahl
    while Zahlensystem[i-2][0] > 0:
        Stelle += 1
        Zahlensystem[i-2].insert(1,chr(ord('0')
                + (Zahlensystem[i - 2][0] % i)))
        Zahlensystem[i-2][0] //= i
    Zahlensystem[i - 2][0] = i    

for i in range(Zahlenraum - 1):
    Resultat[i][0] = Zahlensystem[i][0]
    for j in range(1, len(Zahlensystem[i])):
        Resultat[i][1] += str(Zahlensystem[i][j])

return Resultat

#+END_SRC

#+RESULTS:
|  2 | 1111101000 |
|  3 |    1101001 |
|  4 |      33220 |
|  5 |      13000 |
|  6 |       4344 |
|  7 |       2626 |
|  8 |       1750 |
|  9 |       1331 |
| 10 |       1000 |
| 11 |        82: |
| 12 |        6;4 |
| 13 |        5;< |
| 14 |        516 |
| 15 |        46: |
| 16 |        3>8 |
| 17 |        37> |
| 18 |        31: |
| 19 |        2>< |
| 20 |        2:0 |

